{
  "architectures": ["QwenForCausalLM"],
  "bos_token_id": 0,
  "eos_token_id": 0,
  "hidden_size": 256,
  "intermediate_size": 512,
  "max_position_embeddings": 512,
  "model_type": "qwen",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "torch_dtype": "float32",
  "vocab_size": 16
}
