{
  "add_prefix_space": true,
  "model_max_length": 512,
  "padding_side": "right",
  "truncation_side": "right",
  "tokenizer_class": "QWenTokenizer",
  "clean_up_tokenization_spaces": false,
  "do_lower_case": false
}
